In [11]:
import sqlite3
import pandas as pd

cnx = sqlite3.connect('survey.db')
print(cnx)

dfPerson = pd.read_sql_query("SELECT * FROM person;", cnx)
print(dfPerson)

<sqlite3.Connection object at 0x7f5f4f385650>
         id   personal    family
0      dyer    William      Dyer
1        pb      Frank   Pabodie
2      lake   Anderson      Lake
3       roe  Valentina   Roerich
4  danforth      Frank  Danforth

In [25]:
dfVisited = pd.read_sql_query("SELECT * FROM visited;", cnx)
print(dfVisited)

dfSites = pd.read_sql_query("SELECT * FROM site;", cnx)
print(dfSites)

print(dfVisited[(dfVisited['dated'] < '1930-01-01') & (dfVisited['site'] == 'DR-3')])

dfVisited = pd.read_sql_query("SELECT * FROM visited WHERE site='DR-3' AND dated<'1930-01-01';", cnx)
print(dfVisited)

    id   site       dated
0  619   DR-1  1927-02-08
1  622   DR-1  1927-02-10
2  734   DR-3  1930-01-07
3  735   DR-3  1930-01-12
4  751   DR-3  1930-02-26
5  752   DR-3        None
6  837  MSK-4  1932-01-14
7  844   DR-1  1932-03-22
    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40
Empty DataFrame
Columns: [id, site, dated]
Index: []
Empty DataFrame
Columns: [id, site, dated]
Index: []

In [21]:
dfInner = pd.read_sql_query("SELECT * FROM visited v LEFT JOIN site s ON v.site = s.name;", cnx)
print(dfInner)

    id   site       dated   name    lat    long
0  619   DR-1  1927-02-08   DR-1 -49.85 -128.57
1  622   DR-1  1927-02-10   DR-1 -49.85 -128.57
2  734   DR-3  1930-01-07   DR-3 -47.15 -126.72
3  735   DR-3  1930-01-12   DR-3 -47.15 -126.72
4  751   DR-3  1930-02-26   DR-3 -47.15 -126.72
5  752   DR-3        None   DR-3 -47.15 -126.72
6  837  MSK-4  1932-01-14  MSK-4 -48.87 -123.40
7  844   DR-1  1932-03-22   DR-1 -49.85 -128.57

In [46]:
dfInner = pd.read_sql_query("SELECT * FROM visited v INNER JOIN site s ON v.site = s.name;", cnx)
print(dfInner)

dfInner = pd.read_sql_query("SELECT * FROM visited v LEFT JOIN site s ON v.site = s.name;", cnx)
print(dfInner)

    id   site       dated   name    lat    long
0  619   DR-1  1927-02-08   DR-1 -49.85 -128.57
1  622   DR-1  1927-02-10   DR-1 -49.85 -128.57
2  734   DR-3  1930-01-07   DR-3 -47.15 -126.72
3  735   DR-3  1930-01-12   DR-3 -47.15 -126.72
4  751   DR-3  1930-02-26   DR-3 -47.15 -126.72
5  752   DR-3        None   DR-3 -47.15 -126.72
6  837  MSK-4  1932-01-14  MSK-4 -48.87 -123.40
7  844   DR-1  1932-03-22   DR-1 -49.85 -128.57
    id   site       dated   name    lat    long
0  619   DR-1  1927-02-08   DR-1 -49.85 -128.57
1  622   DR-1  1927-02-10   DR-1 -49.85 -128.57
2  734   DR-3  1930-01-07   DR-3 -47.15 -126.72
3  735   DR-3  1930-01-12   DR-3 -47.15 -126.72
4  751   DR-3  1930-02-26   DR-3 -47.15 -126.72
5  752   DR-3        None   DR-3 -47.15 -126.72
6  837  MSK-4  1932-01-14  MSK-4 -48.87 -123.40
7  844   DR-1  1932-03-22   DR-1 -49.85 -128.57

In [26]:
dfInner = pd.read_sql_query("SELECT * FROM visited v, site s WHERE v.site = s.name;", cnx)
print(dfInner)

    id   site       dated   name    lat    long
0  619   DR-1  1927-02-08   DR-1 -49.85 -128.57
1  622   DR-1  1927-02-10   DR-1 -49.85 -128.57
2  734   DR-3  1930-01-07   DR-3 -47.15 -126.72
3  735   DR-3  1930-01-12   DR-3 -47.15 -126.72
4  751   DR-3  1930-02-26   DR-3 -47.15 -126.72
5  752   DR-3        None   DR-3 -47.15 -126.72
6  837  MSK-4  1932-01-14  MSK-4 -48.87 -123.40
7  844   DR-1  1932-03-22   DR-1 -49.85 -128.57

In [28]:
dfSurvey = pd.read_sql_query("SELECT DISTINCT taken, quant FROM Survey ORDER BY quant;", cnx)
print(dfSurvey)

    taken quant
0     619   rad
1     622   rad
2     734   rad
3     735   rad
4     751   rad
5     752   rad
6     837   rad
7     844   rad
8     619   sal
9     622   sal
10    734   sal
11    735   sal
12    751   sal
13    752   sal
14    837   sal
15    734  temp
16    735  temp
17    751  temp
18    752  temp

In [38]:
dfSurvey = pd.read_sql_query("SELECT * FROM Survey;", cnx)
print(dfSurvey)

dfSurvey = pd.read_sql_query("SELECT quant, COUNT(quant) as Count FROM Survey GROUP BY quant ORDER BY quant DESC;", cnx)
print(dfSurvey)

dfSurvey= pd.read_sql_query("SELECT * FROM Survey WHERE person IN ('lake', 'roe');", cnx)
print(dfSurvey)

    taken person quant  reading
0     619   dyer   rad     9.82
1     619   dyer   sal     0.13
2     622   dyer   rad     7.80
3     622   dyer   sal     0.09
4     734     pb   rad     8.41
5     734   lake   sal     0.05
6     734     pb  temp   -21.50
7     735     pb   rad     7.22
8     735   None   sal     0.06
9     735   None  temp   -26.00
10    751     pb   rad     4.35
11    751     pb  temp   -18.50
12    751   lake   sal     0.10
13    752   lake   rad     2.19
14    752   lake   sal     0.09
15    752   lake  temp   -16.00
16    752    roe   sal    41.60
17    837   lake   rad     1.46
18    837   lake   sal     0.21
19    837    roe   sal    22.50
20    844    roe   rad    11.25
  quant  Count
0  temp      4
1   sal      9
2   rad      8
   taken person quant  reading
0    734   lake   sal     0.05
1    751   lake   sal     0.10
2    752   lake   rad     2.19
3    752   lake   sal     0.09
4    752   lake  temp   -16.00
5    752    roe   sal    41.60
6    837   lake   rad     1.46
7    837   lake   sal     0.21
8    837    roe   sal    22.50
9    844    roe   rad    11.25

In [48]:
import sqlite3
import pandas as pd

cnx = sqlite3.connect('survey.db')
print(cnx)

dfSites = pd.read_sql_query("SELECT * FROM site;", cnx)
dfVisited = pd.read_sql_query("SELECT * FROM visited;", cnx)

dfMerge = pd.merge(dfSites, dfVisited, left_on='name', right_on='site', how='outer').drop('site', axis=1)
print(dfSites)
print(dfVisited)
print(dfMerge)

<sqlite3.Connection object at 0x7f5f4f385ab0>
    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40
    id   site       dated
0  619   DR-1  1927-02-08
1  622   DR-1  1927-02-10
2  734   DR-3  1930-01-07
3  735   DR-3  1930-01-12
4  751   DR-3  1930-02-26
5  752   DR-3        None
6  837  MSK-4  1932-01-14
7  844   DR-1  1932-03-22
    name    lat    long   id       dated
0   DR-1 -49.85 -128.57  619  1927-02-08
1   DR-1 -49.85 -128.57  622  1927-02-10
2   DR-1 -49.85 -128.57  844  1932-03-22
3   DR-3 -47.15 -126.72  734  1930-01-07
4   DR-3 -47.15 -126.72  735  1930-01-12
5   DR-3 -47.15 -126.72  751  1930-02-26
6   DR-3 -47.15 -126.72  752        None
7  MSK-4 -48.87 -123.40  837  1932-01-14

In [50]:
dfsurvey = pd.read_sql_query("SELECT person, count(reading), round(avg(reading), 2) FROM  Survey GROUP BY person;", cnx)
print(dfsurvey)

  person  count(reading)  round(avg(reading), 2)
0   None               2                  -12.97
1   dyer               4                    4.46
2   lake               7                   -1.70
3     pb               5                   -4.00
4    roe               3                   25.12

In [56]:
dfsurvey = pd.read_sql_query("SELECT * FROM Survey", cnx)

gby=dfsurvey.groupby('person').count()
print(gby)
    
gby=dfsurvey.groupby('person')['reading'].mean()
for (g) in gby:
    print("reading mean ", g)
    
gby=dfsurvey.groupby('person')
for (person, taken) in gby:
    print("person ", person, " taken ", taken)

        taken  quant  reading
person
dyer        4      4        4
lake        7      7        7
pb          5      5        5
roe         3      3        3
reading mean  4.46
reading mean  -1.6999999999999997
reading mean  -4.004
reading mean  25.116666666666664
person  dyer  taken     taken person quant  reading
0    619   dyer   rad     9.82
1    619   dyer   sal     0.13
2    622   dyer   rad     7.80
3    622   dyer   sal     0.09
person  lake  taken      taken person quant  reading
5     734   lake   sal     0.05
12    751   lake   sal     0.10
13    752   lake   rad     2.19
14    752   lake   sal     0.09
15    752   lake  temp   -16.00
17    837   lake   rad     1.46
18    837   lake   sal     0.21
person  pb  taken      taken person quant  reading
4     734     pb   rad     8.41
6     734     pb  temp   -21.50
7     735     pb   rad     7.22
10    751     pb   rad     4.35
11    751     pb  temp   -18.50
person  roe  taken      taken person quant  reading
16    752    roe   sal    41.60
19    837    roe   sal    22.50
20    844    roe   rad    11.25